Revit 2027 API
TransmissionData Methods
The TransmissionData type exposes the following members.
Methods
Name | Description
Dispose
DocumentIsNotTransmitted |  Determines whether the document at a given file location is not transmitted.
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAllExternalFileReferenceIds |  Gets the ids of all ExternalFileReferences.
GetDesiredReferenceData |  Gets the ExternalFileReference representing path and load status information to be used the next time this TransmissionData's document is loaded.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLastSavedReferenceData |  Gets the ExternalFileReference representing path and load status information concerning the most recent time this TransmissionData's document was opened.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsDocumentTransmitted |  Determines whether the document at a given file location is transmitted.
ReadTransmissionData |  Reads the TransmissionData associated with the file at the given location.
SetDesiredReferenceData |  Sets the ExternalFileReference information which Revit should use the next time it opens the document which this TransmissionData belongs to.
ToString | Returns a string that represents the current object.
(Inherited from Object)
WriteTransmissionData |  Writes the given TransmissionData into the Revit file at the given location.
Top
See Also
Reference
TransmissionData Class
Autodesk.Revit.DB Namespace